Revit 2027 API
BuiltInFailures.GeneralFailures.FailedToReadLine Property
 Failed to read line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedToReadLine { get; }
Public Shared ReadOnly Property FailedToReadLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedToReadLine {
	FailureDefinitionId^ get ();
}
static member FailedToReadLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace